Revit 2025 API
GlazingTransmittanceColorType Enumeration
 The enumerated type representing the permitted values for the asset property "GlazingTransmittanceColor" from the "Glazing" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum GlazingTransmittanceColorType
Public Enumeration GlazingTransmittanceColorType
public enum class GlazingTransmittanceColorType
type GlazingTransmittanceColorType
Members
Member name | Value | Description
Clear | 0
Green | 1
Gray | 2
Blue | 3
Bluegreen | 4
Bronze | 5
Custom | 6
See Also
Reference
Autodesk.Revit.DB.Visual Namespace